#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.kubernetes_ingress.example_ingress will be created
  + resource "kubernetes_ingress" "example_ingress" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class"             = "nginx"
              + "nginx.ingress.kubernetes.io/enable-cors" = "true"
            }
          + generation       = (known after apply)
          + name             = "foreign-language-reader-ingress"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + host = "api.foreignlanguagereader.com"

              + http {
                  + path {
                      + backend {
                          + service_name = "api"
                          + service_port = "4000"
                        }
                    }
                }
            }
          + rule {
              + host = "language.foreignlanguagereader.com"

              + http {
                  + path {
                      + backend {
                          + service_name = "language-service"
                          + service_port = "8000"
                        }
                    }
                }
            }
          + rule {
              + host = "kibana.foreignlanguagereader.com"

              + http {
                  + path {
                      + backend {
                          + service_name = "kibana-kibana"
                          + service_port = "5601"
                        }
                    }
                }
            }

          + tls {
              + secret_name = "nginx-certificate"
            }
        }
    }

  # module.infrastructure.kubernetes_secret.local_connection_token will be destroyed
  - resource "kubernetes_secret" "local_connection_token" {
      - data = (sensitive value)
      - id   = "default/local-connection-token" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "local-connection-token" -> null
          - namespace        = "default" -> null
          - resource_version = "1767" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/local-connection-token" -> null
          - uid              = "b10f3df0-fd36-46f6-90f9-a9025c3f691c" -> null
        }
    }

  # module.infrastructure.kubernetes_secret.local_connection_token["content"] will be created
  + resource "kubernetes_secret" "local_connection_token" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "local-connection-token"
          + namespace        = "content"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.kubernetes_secret.local_connection_token["default"] will be created
  + resource "kubernetes_secret" "local_connection_token" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "local-connection-token"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.kubernetes_secret.local_connection_token_content will be destroyed
  - resource "kubernetes_secret" "local_connection_token_content" {
      - data = (sensitive value)
      - id   = "content/local-connection-token" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "local-connection-token" -> null
          - namespace        = "content" -> null
          - resource_version = "1106241" -> null
          - self_link        = "/api/v1/namespaces/content/secrets/local-connection-token" -> null
          - uid              = "943ebeb4-e96c-4c7e-b86e-42b066db43f3" -> null
        }
    }

  # module.infrastructure.module.api.digitalocean_database_cluster.api_mysql will be created
  + resource "digitalocean_database_cluster" "api_mysql" {
      + database     = (known after apply)
      + engine       = "mysql"
      + host         = (known after apply)
      + id           = (known after apply)
      + name         = "foreign-language-reader"
      + node_count   = 1
      + password     = (sensitive value)
      + port         = (known after apply)
      + private_host = (known after apply)
      + private_uri  = (sensitive value)
      + region       = "sfo2"
      + size         = "db-s-1vcpu-1gb"
      + uri          = (sensitive value)
      + urn          = (known after apply)
      + user         = (known after apply)
      + version      = "8"
    }

  # module.infrastructure.module.api.digitalocean_database_db.api_database will be created
  + resource "digitalocean_database_db" "api_database" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "foreign-language-reader"
    }

  # module.infrastructure.module.api.digitalocean_database_firewall.allow_kubernetes will be created
  + resource "digitalocean_database_firewall" "allow_kubernetes" {
      + cluster_id = (known after apply)
      + id         = (known after apply)

      + rule {
          + created_at = (known after apply)
          + type       = "k8s"
          + uuid       = (known after apply)
          + value      = "9329c2de-f4e2-4f80-be4c-16fefb26477e"
        }
    }

  # module.infrastructure.module.api.digitalocean_database_user.api_user will be created
  + resource "digitalocean_database_user" "api_user" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "api"
      + password   = (sensitive value)
      + role       = (known after apply)
    }

  # module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.example will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "example" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "api"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = 75

          + scale_target_ref {
              + kind = "Deployment"
              + name = "api"
            }
        }
    }

  # module.infrastructure.module.api.kubernetes_secret.api_database_credentials will be created
  + resource "kubernetes_secret" "api_database_credentials" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "api-database-credentials"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.api.kubernetes_service.api will be created
  + resource "kubernetes_service" "api" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "api"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app" = "api"
            }
          + session_affinity            = "None"
          + type                        = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 4000
              + protocol    = "TCP"
              + target_port = (known after apply)
            }
        }
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_cluster.api_mysql will be destroyed
  - resource "digitalocean_database_cluster" "api_mysql" {
      - database     = "defaultdb" -> null
      - engine       = "mysql" -> null
      - host         = "foreign-language-reader-do-user-1516704-0.db.ondigitalocean.com" -> null
      - id           = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e" -> null
      - name         = "foreign-language-reader" -> null
      - node_count   = 1 -> null
      - password     = (sensitive value)
      - port         = 25060 -> null
      - private_host = "private-foreign-language-reader-do-user-1516704-0.db.ondigitalocean.com" -> null
      - private_uri  = (sensitive value)
      - region       = "sfo2" -> null
      - size         = "db-s-1vcpu-1gb" -> null
      - tags         = [] -> null
      - uri          = (sensitive value)
      - urn          = "do:dbaas:9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e" -> null
      - user         = "doadmin" -> null
      - version      = "8" -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_db.api_database will be destroyed
  - resource "digitalocean_database_db" "api_database" {
      - cluster_id = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e" -> null
      - id         = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e/database/foreign-language-reader" -> null
      - name       = "foreign-language-reader" -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_firewall.allow_kubernetes will be destroyed
  - resource "digitalocean_database_firewall" "allow_kubernetes" {
      - cluster_id = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e" -> null
      - id         = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e-20200314054619647200000002" -> null

      - rule {
          - created_at = "2020-03-15T08:15:55Z" -> null
          - type       = "k8s" -> null
          - uuid       = "45e6183f-6245-4f60-a5ec-4474ba3a9032" -> null
          - value      = "9329c2de-f4e2-4f80-be4c-16fefb26477e" -> null
        }
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_user.api_user will be destroyed
  - resource "digitalocean_database_user" "api_user" {
      - cluster_id        = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e" -> null
      - id                = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e/user/api" -> null
      - mysql_auth_plugin = "caching_sha2_password" -> null
      - name              = "api" -> null
      - password          = (sensitive value)
      - role              = "normal" -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_record.api will be destroyed
  - resource "digitalocean_record" "api" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "api.foreignlanguagereader.com" -> null
      - id       = "92828281" -> null
      - name     = "api" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "138.197.236.201" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_record.kibana will be destroyed
  - resource "digitalocean_record" "kibana" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "kibana.foreignlanguagereader.com" -> null
      - id       = "93327541" -> null
      - name     = "kibana" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "138.197.236.201" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_record.language will be destroyed
  - resource "digitalocean_record" "language" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "language.foreignlanguagereader.com" -> null
      - id       = "92828280" -> null
      - name     = "language" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "138.197.236.201" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.kubernetes_secret.api_database_credentials will be destroyed
  - resource "kubernetes_secret" "api_database_credentials" {
      - data = (sensitive value)
      - id   = "default/api-database-credentials" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "api-database-credentials" -> null
          - namespace        = "default" -> null
          - resource_version = "1768" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/api-database-credentials" -> null
          - uid              = "b50b66f4-a892-45f8-985b-847736b0aa00" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.refresh_definitions_elastic_credentials will be destroyed
  - resource "kubernetes_secret" "refresh_definitions_elastic_credentials" {
      - data = (sensitive value)
      - id   = "content/refresh-definitions-elastic-credentials" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "refresh-definitions-elastic-credentials" -> null
          - namespace        = "content" -> null
          - resource_version = "1106243" -> null
          - self_link        = "/api/v1/namespaces/content/secrets/refresh-definitions-elastic-credentials" -> null
          - uid              = "314fa20e-0d19-43cb-8dd7-9a1d831ad6b4" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.random_password.refresh_definitions_elasticsearch_password will be destroyed
  - resource "random_password" "refresh_definitions_elasticsearch_password" {
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 10 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = (sensitive value)
      - special     = false -> null
      - upper       = true -> null
    }

  # module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.example will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "example" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = 75

          + scale_target_ref {
              + kind = "Deployment"
              + name = "language-service"
            }
        }
    }

  # module.infrastructure.module.language_service.kubernetes_service.api will be created
  + resource "kubernetes_service" "api" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app" = "language-service"
            }
          + session_affinity            = "None"
          + type                        = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 8000
              + protocol    = "TCP"
              + target_port = (known after apply)
            }
        }
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 12 to add, 0 to change, 12 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
